### Read a file in cvs and charge in MS sqlserver table - just as example
> note: The table was previously created in MS sql server, but you can create the table with python code as well.

In [ ]:
import pyodbc
import pandas as pd

In [37]:
# read the file csv
df = pd.read_csv("department.csv")

In [38]:
# show the 10 first of the csv file
df.head(10)

,DepartmentID,Name,GroupName
0,1,Engineering,Research and Development
1,2,Tool Design,Research and Development
2,3,Sales,Sales and Marketing
3,4,Marketing,Sales and Marketing
4,5,Purchasing,Inventory Management
5,6,Research and Development,Research and Development
6,7,Production,Manufacturing
7,8,Production Control,Manufacturing
8,9,Human Resources,Executive General and Administration
9,10,Finance,Executive General and Administration

In [45]:
df.shape

(16, 3)

In [46]:
df.describe().T

              count  mean       std  min   25%  50%    75%   max
DepartmentID   16.0   8.5  4.760952  1.0  4.75  8.5  12.25  16.0

In [39]:
# Create de connection with the MS sql server 
conn = pyodbc.connect('Driver={SQL Server};'
                      'Server=FERNANDOGM;'
                      'Database=Python;'
                      'Trusted_Connection=yes;')

In [40]:
# create and execute a query in the departament table to show if there is data
query = ("SELECT * FROM Departament")
cursor = conn.cursor()
cursor.execute(query)
for row in cursor:
    print(row)

In [41]:
# create and execute the Insert to charge the departament table from the csv file
for index, row in df.iterrows():
    cursor.execute("INSERT INTO Departament (DepartmentID,Name,GroupName) values(?,?,?)", row.DepartmentID, row.Name, row.GroupName)
    conn.commit()

In [42]:
# create and execute a query to show the rows in the table department
query = ("SELECT count(*) FROM Departament")
cursor = conn.cursor()
cursor.execute(query)
for row in cursor:
    print(row)

(16, )

In [43]:
# create and execute a query to show the content in the table department
query = ("SELECT * FROM Departament")
cursor = conn.cursor()
cursor.execute(query)
for row in cursor:
    print(row)

(1, 'Engineering', 'Research and Development')
(2, 'Tool Design', 'Research and Development')
(3, 'Sales', 'Sales and Marketing')
(4, 'Marketing', 'Sales and Marketing')
(5, 'Purchasing', 'Inventory Management')
(6, 'Research and Development', 'Research and Development')
(7, 'Production', 'Manufacturing')
(8, 'Production Control', 'Manufacturing')
(9, 'Human Resources', 'Executive General and Administration')
(10, 'Finance', 'Executive General and Administration')
(11, 'Information Services', 'Executive General and Administration')
(12, 'Document Control', 'Quality Assurance')
(13, 'Quality Assurance', 'Quality Assurance')
(14, 'Facilities and Maintenance', 'Executive General and Administration')
(15, 'Shipping and Receiving', 'Inventory Management')
(16, 'Executive', 'Executive General and Administration')

In [44]:
# close de connection
conn.close()